app/Controllers/Auth/Login.php

            'idUsuario' => $usuario->idUsuario
        ];

        $log->save($data);
---
INSERT INTO `tbl_logs` (`descripcion`, `idUsuario`, `date_create`, `date_update`) VALUES ('Inicio sesión', '2', '2022-06-14 13:55:15', '2022-06-14 13:55:15')