app/Entities/Incidencia.php

    public function mostrarUsuario(string $idUsuario){
        $modelUsuario = model('UsuarioModel');
        $row = $modelUsuario->where('idUsuario',$idUsuario)->get()->getFirstRow();
---
SELECT *
FROM `tbl_usuarios`
WHERE `idUsuario` = '17'