app/Controllers/Admin/Admin.php

UPDATE `tbl_usuarios` SET `estado` = 0, `date_update` = '2022-06-04 23:23:52'
WHERE `tbl_usuarios`.`idUsuario` IN ('1')
---
    public function darDeBaja(){

        $valorRecibidoEstado = $_GET['estado'];
        $valorRecibidoId = $_GET['id'];
        $model = model('UsuarioModel');
        $valorMostar = null;
        $buscar = $model->findAll();

        foreach ($buscar as $key) {
            if(password_verify($key->idUsuario,$valorRecibidoId)){
                $valorMostar = $key->idUsuario;
                break;
            }
        }
        $agregarEstado = (int)$valorRecibidoEstado;

        $data = [
         'estado' => $agregarEstado,
         'idUsuario'  => $valorMostar,
        ];

        $model->save($data);