app/Models/UsuarioModel.php

SELECT *
FROM `tbl_roles`
WHERE `idRol` = '1'
---
    public function buscarRol(string $value){
        $row = $this->db()->table('tbl_roles')->where('idRol',$value)->get()->getFirstRow();